In [2]:
import pandas as pd
import numpy as np

In [3]:
revenue   = pd.Series([14,19,18], index=(1,2,3))
netincome = pd.Series([5,6,6], index = (1,2,3))

In [34]:
np.random.seed(1)
a = np.random.randn(10,4)

In [41]:
import numpy as np 
a = np.array([[1,2,3],[4,5,6]]) 
print (a.shape)    # it will be (2,3) >>> 2 rows and 3 columns

# if you want to reshape it to 3 cols 2 rows
a.shape = (3,2)

a

(2, 3)

array([[1, 2],
       [3, 4],
       [5, 6]])

In [1]:
# an array of evenly spaced numbers 
import numpy as np 
a = np.arange(24) 
a



# this is one dimensional array 
import numpy as np 
a = np.arange(24) 
a.ndim  

# now reshape it 
b = a.reshape(2,4,3)    # split into 2 main groups, then each group contains 4 rows and 3 columns
b 
# b is having three dimensions

array([[[ 0,  1,  2],
        [ 3,  4,  5],
        [ 6,  7,  8],
        [ 9, 10, 11]],

       [[12, 13, 14],
        [15, 16, 17],
        [18, 19, 20],
        [21, 22, 23]]])

In [27]:
a[:,:1]   # slicer column 1

array([[ 1.62434536],
       [ 0.86540763],
       [ 0.3190391 ],
       [-0.3224172 ],
       [-0.17242821],
       [-1.10061918],
       [ 0.90085595],
       [-0.26788808],
       [-0.6871727 ],
       [-1.11731035]])

In [22]:
a[:,1:2]  # slice column 2

array([[-0.90145854],
       [-1.9792738 ],
       [ 2.808147  ],
       [-0.42209023],
       [-1.08409492],
       [ 1.34285141],
       [-0.95672561],
       [-0.36806071],
       [ 0.35379373],
       [ 0.13030729]])

In [20]:
# slicer the first row
a[0]

array([-0.45889573, -0.90145854, -1.10798877,  1.12352766])

In [86]:
df = pd.DataFrame(np.random.randn(10, 4))

In [88]:
pieces = [df[:3], df[3:7], df[7:]]

In [2]:
import numpy as np
revenue = np.array([1,2,3,4,5])
netincome = np.array([10,20,30,40,50])

In [5]:
me = np.vstack((revenue,netincome))

In [9]:
df.index=['a','b','c','d','e']

In [8]:
import pandas as pd
df = pd.DataFrame({'Month1':me[0],'Month2':me[1]})
df

   Month1  Month2
0       1      10
1       2      20
2       3      30
3       4      40
4       5      50

In [10]:
df

   Month1  Month2
a       1      10
b       2      20
c       3      30
d       4      40
e       5      50

In [11]:
import pandas as pd

data = {'name': ['Somu', 'Kiku', 'Amol', 'Lini'],
	'physics': [68, 74, 77, 78],
	'chemistry': [84, 56, 73, 69],
	'algebra': [78, 88, 82, 87]}

In [12]:
df_marks = pd.DataFrame(data)
df_marks

   name  physics  chemistry  algebra
0  Somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87

In [13]:
new_row = {'name':'Geo', 'physics':87, 'chemistry':92, 'algebra':97}
#append row to the dataframe
df_marks = df_marks.append(new_row, ignore_index=True)

In [14]:
df_marks

   name  physics  chemistry  algebra
0  Somu       68         84       78
1  Kiku       74         56       88
2  Amol       77         73       82
3  Lini       78         69       87
4   Geo       87         92       97

In [24]:
df = pd.DataFrame({'val':np.repeat(250,7)})
df.index = pd.date_range('2019-10-01','2019-12-31', freq='14D')

df

            val
2019-10-01  250
2019-10-15  250
2019-10-29  250
2019-11-12  250
2019-11-26  250
2019-12-10  250
2019-12-24  250

In [30]:
df['val'].str.contain

2019-10-01    250
2019-10-15    250
2019-10-29    250
2019-11-12    250
2019-11-26    250
2019-12-10    250
2019-12-24    250
Freq: 14D, Name: val, dtype: int32

In [64]:
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [65]:
animals.groupby('kind').sum()

      height  weight
kind
cat     18.6    17.8
dog     40.0   205.5

In [24]:
url = 'https://www.ozlotteries.com/wednesday-lotto/statistics'

In [25]:
dfs = pd.read_html(url)

dfs

ValueError: No tables found

In [16]:
import numpy as np

In [17]:
df = pd.DataFrame(randn(2, 2))
s = df.to_html(float_format='{0:.40g}'.format)
dfin = pd.read_html(s, index_col=0)

NameError: name 'randn' is not defined

In [18]:
dfs

[                                             Bank Name                City  \
 0                                 The Enloe State Bank              Cooper
 1                  Washington Federal Bank for Savings             Chicago
 2      The Farmers and Merchants State Bank of Argonia             Argonia
 3                                  Fayette County Bank          Saint Elmo
 4    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 5                                       First NBC Bank         New Orleans
 6                                        Proficio Bank  Cottonwood Heights
 7                        Seaway Bank and Trust Company             Chicago
 8                               Harvest Community Bank          Pennsville
 9                                          Allied Bank            Mulberry
 10                        The Woodbury Banking Company            Woodbury
 11                              First CornerStone Bank     King of Prussia
 12                                  Trust Company Bank             Memphis
 13                          North Milwaukee State Bank           Milwaukee
 14                              Hometown National Bank            Longview
 15                                 The Bank of Georgia      Peachtree City
 16                                        Premier Bank              Denver
 17                                      Edgebrook Bank             Chicago
 18                              Doral Bank  En Español            San Juan
 19                   Capitol City Bank & Trust Company             Atlanta
 20                             Highland Community Bank             Chicago
 21                    First National Bank of Crestview           Crestview
 22                                  Northern Star Bank             Mankato
 23              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 24               The National Republic Bank of Chicago             Chicago
 25                                      NBRS Financial          Rising Sun
 26                               GreenChoice Bank, fsb             Chicago
 27                            Eastside Commercial Bank             Conyers
 28                              The Freedom State Bank             Freedom
 29                                         Valley Bank     Fort Lauderdale
 ..                                                 ...                 ...
 526                                  ANB Financial, NA         Bentonville
 527                                          Hume Bank                Hume
 528                             Douglass National Bank         Kansas City
 529                                  Miami Valley Bank            Lakeview
 530                                            NetBank          Alpharetta
 531                          Metropolitan Savings Bank          Pittsburgh
 532                                    Bank of Ephraim             Ephraim
 533                                      Reliance Bank        White Plains
 534              Guaranty National Bank of Tallahassee         Tallahassee
 535                                Dollar Savings Bank              Newark
 536                               Pulaski Savings Bank        Philadelphia
 537              First National Bank of Blanchardville      Blanchardville
 538                              Southern Pacific Bank            Torrance
 539                        Farmers Bank of Cheneyville         Cheneyville
 540                                      Bank of Alamo               Alamo
 541             AmTrade International Bank  En Español             Atlanta
 542                     Universal Federal Savings Bank             Chicago
 543                       Connecticut Bank of Commerce            Stamford
 544                                   New Century Bank     Shelby Township
 545                              Net 1st National Bank          Boca Raton
 546                                       NextBank, NA             Phoenix
 547                           Oakwood Deposit Bank Co.             Oakwood
 548                              Bank of Sierra Blanca       Sierra Blanca
 549                      Hamilton Bank, NA  En Español               Miami
 550                             Sinclair National Bank            Gravette
 551                                 Superior Bank, FSB            Hinsdale
 552                                Malta National Bank               Malta
 553                    First Alliance Bank & Trust Co.          Manchester
 554                  National State Bank of Metropolis          Metropolis
 555                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    TX  10716                   Legend Bank, N. A.        May 31, 2019
 1    IL  30570                   Royal Savings Bank   December 15, 2017
 2    KS  17719                          Conway Bank    October 13, 2017
 3    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 4    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 5    LA  58302                         Whitney Bank      April 28, 2017
 6    UT  35495                    Cache Valley Bank       March 3, 2017
 7    IL  19328                  State Bank of Texas    January 27, 2017
 8    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 9    AR     91                         Today's Bank  September 23, 2016
 10   GA  11297                          United Bank     August 19, 2016
 11   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 12   TN   9956           The Bank of Fayette County      April 29, 2016
 13   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 14   WA  35156                       Twin City Bank     October 2, 2015
 15   GA  35259                        Fidelity Bank     October 2, 2015
 16   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 17   IL  57772             Republic Bank of Chicago         May 8, 2015
 18   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 19   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 20   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 21   FL  17557                       First NBC Bank    January 16, 2015
 22   MN  34983                            BankVista   December 19, 2014
 23   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 24   IL    916                  State Bank of Texas    October 24, 2014
 25   MD   4862                          Howard Bank    October 17, 2014
 26   IL  28462                 Providence Bank, LLC       July 25, 2014
 27   GA  58125            Community & Southern Bank       July 18, 2014
 28   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 29   FL  21793  Landmark Bank, National Association       June 20, 2014
 ..   ..    ...                                  ...                 ...
 526  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 527  MO   1971                        Security Bank       March 7, 2008
 528  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 529  OH  16848         The Citizens Banking Company     October 4, 2007
 530  GA  32575                           ING DIRECT  September 28, 2007
 531  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 532  UT   1249                        Far West Bank       June 25, 2004
 533  NY  26778                     Union State Bank      March 19, 2004
 534  FL  26838              Hancock Bank of Florida      March 12, 2004
 535  NJ  31330                          No Acquirer   February 14, 2004
 536  PA  27203                       Earthstar Bank   November 14, 2003
 537  WI  11639                        The Park Bank         May 9, 2003
 538  CA  27094                            Beal Bank    February 7, 2003
 539  LA  16445            Sabine State Bank & Trust   December 17, 2002
 540  TN   9961                          No Acquirer    November 8, 2002
 541  GA  33784                          No Acquirer  September 30, 2002
 542  IL  29355               Chicago Community Bank       June 27, 2002
 543  CT  19183                   Hudson United Bank       June 26, 2002
 544  MI  34979                          No Acquirer      March 28, 2002
 545  FL  26652                       Bank Leumi USA       March 1, 2002
 546  AZ  22314                          No Acquirer    February 7, 2002
 547  OH   8966       The State Bank & Trust Company    February 1, 2002
 548  TX  22002     The Security State Bank of Pecos    January 18, 2002
 549  FL  24382     Israel Discount Bank of New York    January 11, 2002
 550  AR  34248                   Delta Trust & Bank   September 7, 2001
 551  IL  32646                Superior Federal, FSB       July 27, 2001
 552  OH   6629                    North Valley Bank         May 3, 2001
 553  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 554  IL   3815              Banterra Bank of Marion   December 14, 2000
 555  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0         June 18, 2019
 1      February 1, 2019
 2     February 21, 2018
 3      January 29, 2019
 4        March 22, 2018
 5      January 29, 2019
 6      January 29, 2019
 7      January 29, 2019
 8          May 18, 2017
 9          May 13, 2019
 10    December 13, 2018
 11    November 13, 2018
 12   September 14, 2018
 13     January 29, 2019
 14    February 19, 2018
 15         July 9, 2018
 16    February 20, 2018
 17     January 29, 2019
 18     January 29, 2019
 19     January 29, 2019
 20    November 15, 2017
 21    November 15, 2017
 22      January 3, 2018
 23    November 10, 2016
 24      January 6, 2016
 25     January 29, 2019
 26    December 12, 2016
 27      October 6, 2017
 28    February 21, 2018
 29     January 29, 2019
 ..                  ...
 526    February 1, 2019
 527    January 31, 2019
 528    October 26, 2012
 529  September 12, 2016
 530    January 31, 2019
 531    October 27, 2010
 532       April 9, 2008
 533       April 9, 2008
 534      April 17, 2018
 535       April 9, 2008
 536     October 6, 2017
 537        June 5, 2012
 538    October 20, 2008
 539    October 20, 2004
 540      March 18, 2005
 541  September 11, 2006
 542     October 6, 2017
 543   February 14, 2012
 544      March 18, 2005
 545       April 9, 2008
 546    February 5, 2015
 547    October 25, 2012
 548    November 6, 2003
 549  September 21, 2015
 550     October 6, 2017
 551     August 19, 2014
 552   November 18, 2002
 553   February 18, 2003
 554      March 17, 2005
 555      March 17, 2005

 [556 rows x 7 columns]]

In [20]:
t = dfs[0]
type(t)

pandas.core.frame.DataFrame

In [21]:
t[0:2]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"

In [23]:
t[t.City='Chicago']

SyntaxError: invalid syntax (<ipython-input-23-3ce69c93d8a1>, line 1)

In [36]:
from tabula import read_pdf

In [39]:
df = read_pdf("H:/SharedLaptop/CBA.pdf")

In [47]:
a = df[31:32]

In [52]:
a.iloc[:,1:5]

   2011  2012       2013  2014
31  NaN   NaN  2.53 2.25  2.11

In [50]:
a

,2009 2010,2011,2012,2013,2014,2015,2016,2017,2018,YTD,Performance
31,"201 Sussex Street, Sydney, NSW 2000",NaN,NaN,2.53 2.25,2.11,2.33 2.78,2.84,2.78 2.35,2.23,1.90 2.13,Price/Book

In [63]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['2016', '2017', '2018', '2019'])

In [64]:
df

       2016      2017      2018      2019
0 -0.517015 -0.398152 -0.275460 -1.371037
1  0.213782  1.055123  0.227594  0.016428
2 -1.563594 -0.438396  0.125495  0.603876
3  0.052311 -0.904486 -0.823760 -0.062085
4  0.962081 -2.026449  2.294269  0.754720
5 -0.192392 -0.620497 -1.378860  0.665932
6 -0.683663 -1.622223 -0.447584 -1.178019
7  1.315376 -0.796453 -1.780724 -0.827947

In [72]:
val = df.iloc[3]

In [79]:
df.append(val2, ignore_index=True)

       2016      2017      2018      2019
0 -0.517015 -0.398152 -0.275460 -1.371037
1  0.213782  1.055123  0.227594  0.016428
2 -1.563594 -0.438396  0.125495  0.603876
3  0.052311 -0.904486 -0.823760 -0.062085
4  0.962081 -2.026449  2.294269  0.754720
5 -0.192392 -0.620497 -1.378860  0.665932
6 -0.683663 -1.622223 -0.447584 -1.178019
7  1.315376 -0.796453 -1.780724 -0.827947
8  1.000000  2.000000  3.000000  4.000000

In [74]:
type(val)

pandas.core.series.Series

In [81]:
df

       2016      2017      2018      2019
0 -0.517015 -0.398152 -0.275460 -1.371037
1  0.213782  1.055123  0.227594  0.016428
2 -1.563594 -0.438396  0.125495  0.603876
3  0.052311 -0.904486 -0.823760 -0.062085
4  0.962081 -2.026449  2.294269  0.754720
5 -0.192392 -0.620497 -1.378860  0.665932
6 -0.683663 -1.622223 -0.447584 -1.178019
7  1.315376 -0.796453 -1.780724 -0.827947

In [78]:
val2 = pd.Series([1,2,3,4],index=['2016','2017','2018','2019'])
val2

2016    1
2017    2
2018    3
2019    4
dtype: int64

In [96]:
mydf = pd.DataFrame({'a':a,'b':b})
mydf

   a  b
0  1  3
1  2  4

In [97]:
a = [1,2]
b = [3,4]

In [102]:
myval = mydf.iloc[1:2]

In [66]:
type(myval)

NameError: name 'myval' is not defined

In [104]:
myval

   a  b
1  2  4

In [106]:
mydf.columns

Index(['a', 'b'], dtype='object')

In [107]:
mydf.index

RangeIndex(start=0, stop=2, step=1)